Tekla Open API Reference for Tekla Structures 2025
ModelObjectVisualization.ClearTemporaryStates Method
 Clears temporary visualization from model objects and restores permanent representation.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool ClearTemporaryStates(
	List<ModelObject> modelObjects
)
Public Shared Function ClearTemporaryStates (
	modelObjects As List(Of ModelObject)
) As Boolean
Parameters
modelObjects
Type: System.Collections.Generic.List<ModelObject>
[Missing <param name="modelObjects"/> documentation for "M:Tekla.Structures.Model.UI.ModelObjectVisualization.ClearTemporaryStates(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject})"]
Return Value
Type: Boolean
True if the permanent representation could be restored.
See Also
Reference
ModelObjectVisualization Class
Tekla.Structures.Model.UI Namespace